#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
// Возвращает выборку из запроса с плановой себестоимостью номенклатуры
//
// Параметры:
//   ПараметрыЗапроса - Структура:
//     * ТаблицаЗапасы - ТаблицаЗначений - таблица с данными о запасах
//     * Дата - Дата - дата для получения среза цен
//   ПроверкаСебестоимости - Булево - если Истина, возвращает только записи с ценой ниже плановой себестоимости
//
// Возвращаемое значение:
//   ВыборкаИзРезультатаЗапроса - выборка со следующими полями:
//     * Номенклатура - СправочникСсылка.Номенклатура - номенклатура
//     * Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - характеристика
//     * НомерСтроки - Число - номер строки из исходной таблицы
//     * Цена - Число - цена из исходной таблицы
//     * ПлановаяСебестоимость - Число - плановая себестоимость из регистра цен
Функция М3_ПолучитьПлановуюСебестоимость(ПараметрыЗапроса, ПроверкаСебестоимости = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаЗапасы", ПараметрыЗапроса.ТаблицаЗапасы);
	Запрос.УстановитьПараметр("Дата", ПараметрыЗапроса.Дата);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Запасы.Номенклатура КАК Номенклатура,
	|	Запасы.Характеристика КАК Характеристика,
	|	Запасы.НомерСтроки КАК НомерСтроки,
	|	Запасы.Цена КАК Цена
	|ПОМЕСТИТЬ ТаблицаЗапасы
	|ИЗ
	|	&ТаблицаЗапасы КАК Запасы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.НомерСтроки КАК НомерСтроки,
	|	ТаблицаЗапасы.Цена КАК Цена,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК ПлановаяСебестоимость
	|ИЗ
	|	ТаблицаЗапасы КАК ТаблицаЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(КОНЕЦПЕРИОДА(&Дата, ДЕНЬ), ВидЦен В
	|			(ВЫБРАТЬ
	|				М3_ФункциональнаяОпцияПлановаяСебестоимость.Значение КАК Значение
	|			ИЗ
	|				Константа.М3_ФункциональнаяОпцияПлановаяСебестоимость КАК М3_ФункциональнаяОпцияПлановаяСебестоимость)
	|		И (Номенклатура, Характеристика) В
	|			(ВЫБРАТЬ
	|				ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|				ТаблицаЗапасы.Характеристика КАК Характеристика
	|			ИЗ
	|				ТаблицаЗапасы КАК ТаблицаЗапасы)) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ТаблицаЗапасы.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|		И ТаблицаЗапасы.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика";

	Если ПроверкаСебестоимости Тогда
		Запрос.Текст = Запрос.Текст + "
									  |ГДЕ
									  |	ТаблицаЗапасы.Цена <  ЦеныНоменклатурыСрезПоследних.Цена";
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Возврат ВыборкаДетальныеЗаписи;

КонецФункции

#КонецОбласти

#КонецЕсли