#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
&После("ОбработкаПроверкиЗаполнения")
Процедура М3_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	ПараметрыЗапроса = Новый Структура("ТаблицаЗапасы, Дата", Запасы, Дата);
	ВыборкаОшибки = Документы.ЗаказПокупателя.М3_ПолучитьПлановуюСебестоимость(ПараметрыЗапроса, Истина);
	
	Если ВыборкаОшибки.Количество() > 0 И Не УправлениеДоступом.ЕстьРоль("М3_ОтключениеКонтроляПлановойСебестомости") Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Пока ВыборкаОшибки.Следующий() Цикл

		ТекстСообщения = "Цена не может быть ниже плановой себестоимости";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.Запасы[" + Формат(ВыборкаОшибки.НомерСтроки
			- 1, "ЧГ=0") + "].Цена");

	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
