#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
&После("ОбработкаПроверкиЗаполнения")
Процедура М3_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	ПараметрыЗапроса = Новый Структура("ТаблицаЗапасы, Дата", Запасы, Дата);
	ВыборкаОшибки = Документы.ЗаказПокупателя.М3_ПолучитьПлановуюСебестоимость(ПараметрыЗапроса, Истина);
	Пока ВыборкаОшибки.Следующий() Цикл
		Текст = "Цена не может быть ниже плановой себестоимости";
	    ОбщегоНазначения.СообщитьПользователю(Текст,,"Объект.Запасы["+Формат(ВыборкаОшибки.НомерСтроки-1, "ЧГ=0")+"].Цена",,Отказ);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
