#Область ОбработчикиСобытийФормы
&НаСервере
Процедура М3_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	М3_ДобавитьЭлементПлановаяСебестоимостьНаФорму();
	М3_ЗаполнитьПлановуюСебестоимостьПоТоварам();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗапасы
&НаКлиенте
Процедура М3_ЗапасыНоменклатураПриИзмененииПосле(Элемент)
	М3_ЗаполнитьПлановуюСебестоимость();
КонецПроцедуры

&НаКлиенте
Процедура М3_ЗапасыХарактеристикаПриИзмененииПосле(Элемент)
	М3_ЗаполнитьПлановуюСебестоимость();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура М3_ДобавитьЭлементПлановаяСебестоимостьНаФорму()

	ЭлементПлановаяСебестоимость = М3_УправлениеФормойСервер.ДобавитьПолеФормы(
		ЭтотОбъект, "М3_ПлановаяСебестоимость", "Объект.Запасы.М3_ПлановаяСебестоимость", "Запасы",
		ВидПоляФормы.ПолеВвода);

	Если ЭлементПлановаяСебестоимость <> Неопределено Тогда
		ЭлементПлановаяСебестоимость.ТолькоПросмотр = Истина;
		Элементы.Переместить(ЭлементПлановаяСебестоимость, Элементы.Запасы, Элементы.ЗапасыАвтоматическаяСкидка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура М3_ЗаполнитьПлановуюСебестоимость()

	ТекущаяСтрока = Элементы.Запасы.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекущаяСтрока.М3_ПлановаяСебестоимость = М3_ПолучитьПлановуюСебестоимостьНоменклатуры();

КонецПроцедуры

&НаСервере
Процедура М3_ЗаполнитьПлановуюСебестоимостьПоТоварам()
	
	ТаблицаДанных = Объект.Запасы.Выгрузить( , "Номенклатура, Характеристика, НомерСтроки, Цена");
	ПараметрыЗапроса = Новый Структура("ТаблицаЗапасы, Дата", ТаблицаДанных, Объект.Дата);
	ВыборкаСебестоимость = Документы.ЗаказПокупателя.М3_ПолучитьПлановуюСебестоимость(ПараметрыЗапроса, Ложь);

	Пока ВыборкаСебестоимость.Следующий() Цикл
		Объект.Запасы[ВыборкаСебестоимость.НомерСтроки
			- 1].М3_ПлановаяСебестоимость = ВыборкаСебестоимость.ПлановаяСебестоимость;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция М3_ПолучитьПлановуюСебестоимостьНоменклатуры()

	ТаблицаДанных = Объект.Запасы.Выгрузить( , "Номенклатура, Характеристика, НомерСтроки, Цена");
	ПараметрыЗапроса = Новый Структура("ТаблицаЗапасы, Дата", ТаблицаДанных, Объект.Дата);
	ВыборкаСебестоимость = Документы.ЗаказПокупателя.М3_ПолучитьПлановуюСебестоимость(ПараметрыЗапроса, Ложь);
	ВыборкаСебестоимость.Следующий();

	Возврат ВыборкаСебестоимость.ПлановаяСебестоимость;

КонецФункции

#КонецОбласти