#Область ОбработчикиСобытийФормы
&НаСервере
Процедура М3_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
   М3_ДобавитьЭлементПлановаяСебестоимостьНаФорму();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура М3_ДобавитьЭлементПлановаяСебестоимостьНаФорму()
	
	ЭлементПлановаяСебестоимость = М3_УправлениеФормойСервер.ДобавитьПолеФормы(
		ЭтотОбъект,
		"М3_ПлановаяСебестоимость",
		"Объект.Запасы.М3_ПлановаяСебестоимость",
		"Запасы",
		ВидПоляФормы.ПолеВвода); 
	
	Если ЭлементПлановаяСебестоимость <> Неопределено Тогда
		ЭлементПлановаяСебестоимость.ТолькоПросмотр = Истина;
		Элементы.Переместить(ЭлементПлановаяСебестоимость, Элементы.Запасы, Элементы.ЗапасыАвтоматическаяСкидка);
	КонецЕсли;

КонецПроцедуры	
#КонецОбласти