#Область ПрограммныйИнтерфейс

//Функция - обавляет поле формы в указанную группу и связывает его с реквизитом объекта. 
//
//Параметры:
//Форма - ФормаКлиентскогоПриложения - на которую добавляем элемент
//ИмяЭлемента - Строка - Имя добавляемого элемента
//ПутьКДанным - Строка - ПутьКДанным
//ИмяГруппы - Строка - Имя группы формы которому подчиняем элемент
//ВидПоляФормы - ВидПоляФормы - пример: "ВидПоляФормы.ПолеВвода", "ВидПоляФормы.ПолеФлажка" и т.д.  
//
//Возвращаемое значение:
//  ПолеФормы - созданный элемент формы или Неопределено,
//              если элемент с таким именем уже существует
//Пример: ДобавитьПолеФормы(ЭтаФорма, "Контрагент", "Объект.Контрагент", "ГруппаРеквизитаФормыГоризонтально", ВидПоляФормы.ПолеВвода); 
Функция ДобавитьПолеФормы(Форма, ИмяЭлемента, ПутьКДанным = Неопределено, ИмяГруппы = "", ВидПоляФормы) Экспорт
	
	ЭлементыФормы = Форма.Элементы;
	ГруппаФормы = ЭлементыФормы.Найти(ИмяГруппы);
	
	Если ЭлементыФормы.Найти(ИмяЭлемента) = Неопределено Тогда
		
		Если ГруппаФормы = Неопределено Тогда 
			ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"));
		Иначе
			ЭлементФормы = ЭлементыФормы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);
		КонецЕсли;
		
		ЭлементФормы.Вид = ВидПоляФормы; 
		
		Если ЗначениеЗаполнено(ПутьКДанным) Тогда
			ЭлементФормы.ПутьКДанным = ПутьКДанным;
		КонецЕсли; 
		
		Возврат ЭлементФормы;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции 

#КонецОбласти