#Область ОбработчикиСобытийФормы
&НаСервере
Процедура М3_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	М3_ДобавитьРеквизитИЭлементПлановойСебестоимости();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура М3_ПлановаяСебестоимостьПриИзменении(Элемент)
    ПриИзмененииЭлементаУНФ(Элемент);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура М3_ДобавитьРеквизитИЭлементПлановойСебестоимости()
	
	ИмяРеквизита = "М3_ФункциональнаяОпцияПлановаяСебестоимость";
	
	РеквизитыФормы = ПолучитьРеквизиты();
	Для Каждого РеквизитФормы Из РеквизитыФормы Цикл
		Если РеквизитФормы.Имя = ИмяРеквизита Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
		ИмяРеквизита,
		Метаданные.Константы.М3_ФункциональнаяОпцияПлановаяСебестоимость.Тип,,
		"Плановая себестоимость"));
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);

	ЭлементПлановаяСебестоимость = М3_УправлениеФормойСервер.ДобавитьПолеФормы(
		ЭтотОбъект,
		ИмяРеквизита,
		ИмяРеквизита,
		"СтраницаПродажиГруппаПродажи",
		ВидПоляФормы.ПолеВвода); 
	
	Если ЭлементПлановаяСебестоимость <> Неопределено Тогда
		ЭлементПлановаяСебестоимость.УстановитьДействие("ПриИзменении", "М3_ПлановаяСебестоимостьПриИзменении");
	КонецЕсли;
	
КонецПроцедуры

#Область ПереопределяемаяЧасть
&ИзменениеИКонтроль("ПриОпределенииКонстантНаФорме")
&НаСервере
Процедура М3_ПриОпределенииКонстантНаФорме(КонстантыНаФорме)

	//@skip-check module-unused-local-variable
	ВсеКонстанты = Метаданные.Константы.АвтоматическиНастраиватьРазрешенияВПрофиляхБезопасности.Имя;

	КонстантыНаФорме.Вставить("АвтоматическиПланироватьОперацийЗаказомНаПроизводство",
		Метаданные.Константы.АвтоматическиПланироватьОперацийЗаказомНаПроизводство.Имя);
	КонстантыНаФорме.Вставить("АвтоПодборНомеровГТД",
		Метаданные.Константы.АвтоПодборНомеровГТД.Имя);
	КонстантыНаФорме.Вставить("АрхивироватьЧекиККМПриЗакрытииКассовойСмены",
		Метаданные.Константы.АрхивироватьЧекиККМПриЗакрытииКассовойСмены.Имя);
	КонстантыНаФорме.Вставить("БиллингВестиУчетРасходовПоДоговорамОбслуживания",
		Метаданные.Константы.БиллингВестиУчетРасходовПоДоговорамОбслуживания.Имя);
	КонстантыНаФорме.Вставить("БиллингГоловноеНаправлениеДеятельности",
		Метаданные.Константы.БиллингГоловноеНаправлениеДеятельности.Имя);
	КонстантыНаФорме.Вставить("ВалютаУчета",
		Метаданные.Константы.ВалютаУчета.Имя);
	КонстантыНаФорме.Вставить("ВариантПечатиДоставки",
		Метаданные.Константы.ВариантПечатиДоставки.Имя);
	КонстантыНаФорме.Вставить("ВестиУчетСредствИндивидуальнойЗащиты",
		Метаданные.Константы.ВестиУчетСредствИндивидуальнойЗащиты.Имя);
	КонстантыНаФорме.Вставить("ДобавитьСловоДоговорВПредставлениеДоговораОснованияПечати",
		Метаданные.Константы.ДобавитьСловоДоговорВПредставлениеДоговораОснованияПечати.Имя);
	КонстантыНаФорме.Вставить("ЗачитыватьАвансыДолгиАвтоматически",
		Метаданные.Константы.ЗачитыватьАвансыДолгиАвтоматически.Имя);
	КонстантыНаФорме.Вставить("ИспользоватьБиллинг",
		Метаданные.Константы.ИспользоватьБиллинг.Имя);
	КонстантыНаФорме.Вставить("ИспользоватьВидыЗаказНарядов",
		Метаданные.Константы.ИспользоватьВидыЗаказНарядов.Имя);
	КонстантыНаФорме.Вставить("ИспользоватьВидыЗаказовПокупателей",
		Метаданные.Константы.ИспользоватьВидыЗаказовПокупателей.Имя);
	КонстантыНаФорме.Вставить("ИспользоватьКорректировкиПоступлений",
		Метаданные.Константы.ИспользоватьКорректировкиПоступлений.Имя);
	КонстантыНаФорме.Вставить("ИспользоватьКорректировкиРеализаций",
		Метаданные.Константы.ИспользоватьКорректировкиРеализаций.Имя);
	КонстантыНаФорме.Вставить("ИспользоватьНесколькоВариантовКП",
		Метаданные.Константы.ИспользоватьНесколькоВариантовКП.Имя);
	КонстантыНаФорме.Вставить("ИспользоватьНесколькоОрганизаций",
		Метаданные.Константы.ИспользоватьНесколькоОрганизаций.Имя);
	КонстантыНаФорме.Вставить("ИспользоватьНеуникальныеШтрихКоды",
		Метаданные.Константы.ИспользоватьНеуникальныеШтрихКоды.Имя);
	КонстантыНаФорме.Вставить("ИспользоватьСегментыНоменклатуры",
		Метаданные.Константы.ИспользоватьСегментыНоменклатуры.Имя);
	КонстантыНаФорме.Вставить("ИспользоватьРемонты",
		Метаданные.Константы.ИспользоватьРемонты.Имя);
	КонстантыНаФорме.Вставить("ИспользоватьРучноеРаспределениеМатериаловПоУмолчанию",
		Метаданные.Константы.ИспользоватьРучноеРаспределениеМатериаловПоУмолчанию.Имя);
	КонстантыНаФорме.Вставить("ИспользоватьЧатботов",
		Метаданные.Константы.ИспользоватьЧатботов.Имя);
	КонстантыНаФорме.Вставить("ИспользоватьШтрихкодированиеПечатныхФормОбъектов",
		Метаданные.Константы.ИспользоватьШтрихкодированиеПечатныхФормОбъектов.Имя);
	КонстантыНаФорме.Вставить("Компания",
		Метаданные.Константы.Компания.Имя);
	КонстантыНаФорме.Вставить("КонтактнаяИнформацияТоварногоЧека",
		Метаданные.Константы.КонтактнаяИнформацияТоварногоЧека.Имя);
	КонстантыНаФорме.Вставить("КонтролироватьОстаткиПоНомерамГТД",
		Метаданные.Константы.КонтролироватьОстаткиПоНомерамГТД.Имя);
	КонстантыНаФорме.Вставить("КонтролироватьОстаткиПриПробитииЧековККМ",
		Метаданные.Константы.КонтролироватьОстаткиПриПробитииЧековККМ.Имя);
	КонстантыНаФорме.Вставить("НациональнаяВалюта",
		Метаданные.Константы.НациональнаяВалюта.Имя);
	КонстантыНаФорме.Вставить("ОтправкаЭлектронныхЧековПослеПробитияЧека",
		Метаданные.Константы.ОтправкаЭлектронныхЧековПослеПробитияЧека.Имя);
	КонстантыНаФорме.Вставить("ОтслеживатьСтатусыОтчетовОРозничныхПродажах",
		Метаданные.Константы.ОтслеживатьСтатусыОтчетовОРозничныхПродажах.Имя);
	КонстантыНаФорме.Вставить("УказыватьПричинуВозвратов",
		Метаданные.Константы.УказыватьПричинуВозвратов.Имя);
	КонстантыНаФорме.Вставить("ПередачаТоваровМеждуОрганизациями",
		Метаданные.Константы.ПередачаТоваровМеждуОрганизациями.Имя);
	КонстантыНаФорме.Вставить("ПечатьПользовательскихЕдиницИзмерения",
		Метаданные.Константы.ПечатьПользовательскихЕдиницИзмерения.Имя);
	КонстантыНаФорме.Вставить("ПредставлениеКодовВПечатныхФормах",
		Метаданные.Константы.ПредставлениеКодовВПечатныхФормах.Имя);
	КонстантыНаФорме.Вставить("ПредставлениеНомераДокументаБезПрефиксаИнформационнойБазы",
		Метаданные.Константы.ПредставлениеНомераДокументаБезПрефиксаИнформационнойБазы.Имя);
	КонстантыНаФорме.Вставить("ПредставлениеНомераДокументаБезПрефиксаОрганизации",
		Метаданные.Константы.ПредставлениеНомераДокументаБезПрефиксаОрганизации.Имя);
	КонстантыНаФорме.Вставить("ПредставлениеНомераДокументаБезПрефиксаПользователя",
		Метаданные.Константы.ПредставлениеНомераДокументаБезПрефиксаПользователя.Имя);
	КонстантыНаФорме.Вставить("ПредставлениеНомераДокументаСЛидирующимиНулями",
		Метаданные.Константы.ПредставлениеНомераДокументаСЛидирующимиНулями.Имя);
	КонстантыНаФорме.Вставить("ПредставлениеСкидкиВПечатнойФорме",
		Метаданные.Константы.ПредставлениеСкидкиВПечатнойФорме.Имя);
	КонстантыНаФорме.Вставить("ВыводитьСуммуБезСкидки",
		Метаданные.Константы.ВыводитьСуммуБезСкидки.Имя);
	КонстантыНаФорме.Вставить("РасчетСтоимостиОперацийПоНормеВремени",
		Метаданные.Константы.РасчетСтоимостиОперацийПоНормеВремени.Имя);
	КонстантыНаФорме.Вставить("СпособЗачетаПредоплатыПоУмолчанию",
		Метаданные.Константы.СпособЗачетаПредоплатыПоУмолчанию.Имя);
	КонстантыНаФорме.Вставить("СпособРазнесенияОплатыПоУмолчанию",
		Метаданные.Константы.СпособРазнесенияОплатыПоУмолчанию.Имя);
	КонстантыНаФорме.Вставить("СрокОплатыПокупателя",
		Метаданные.Константы.СрокОплатыПокупателя.Имя);
	КонстантыНаФорме.Вставить("СрокОплатыПоставщику",
		Метаданные.Константы.СрокОплатыПоставщику.Имя);
	КонстантыНаФорме.Вставить("ТребоватьЗаполнениеГТДИмпортногоТовара",
		Метаданные.Константы.ТребоватьЗаполнениеГТДИмпортногоТовара.Имя);
	КонстантыНаФорме.Вставить("УдалятьНепробитыеЧекиПриЗакрытииКассовойСмены",
		Метаданные.Константы.УдалятьНепробитыеЧекиПриЗакрытииКассовойСмены.Имя);
	КонстантыНаФорме.Вставить("УчетПоКомпании",
		Метаданные.Константы.УчетПоКомпании.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияВестиУчетНалогаНаДоходыИВзносов",
		Метаданные.Константы.ФункциональнаяОпцияВестиУчетНалогаНаДоходыИВзносов.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером",
		Метаданные.Константы.ФункциональнаяОпцияВестиУчетРасчетовСБанкомЭквайрером.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияВестиШтатноеРасписание",
		Метаданные.Константы.ФункциональнаяОпцияВестиШтатноеРасписание.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияВыполнениеЭтаповРазнымиПодразделениями",
		Метаданные.Константы.ФункциональнаяОпцияВыполнениеЭтаповРазнымиПодразделениями.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияВыполнятьРасчетНДФЛПоПрогрессивнойШкале",
		Метаданные.Константы.ФункциональнаяОпцияВыполнятьРасчетНДФЛПоПрогрессивнойШкале.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьАвтоматическиеСкидкиНаценки",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьАвтоматическиеСкидкиНаценки.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьАгентскиеУслуги",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьАгентскиеУслуги.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьБонусныеПрограммы",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьБонусныеПрограммы.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьПромокоды",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьПромокоды.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьБюджетирование",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьБюджетирование.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьДисконтныеКарты",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьДисконтныеКарты.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьЗаказыВРозничнойТорговлеДляНастроек",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьЗаказыВРозничнойТорговлеДляНастроек.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьКорректировкиДолга",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьКорректировкиДолга.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьНаборы",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьНаборы.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьОплатуКартамиВОптовойТорговле",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьОплатуКартамиВОптовойТорговле.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьОплатуКредитом",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьОплатуКредитом.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьОрдерныйСклад",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьОрдерныйСклад.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьОтчетность",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьОтчетность.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьПараметрическиеСпецификации",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьПараметрическиеСпецификации.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьПартии",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьПартии.Имя);
	КонстантыНаФорме.Вставить("ИспользоватьСерииНоменклатуры",
		Метаданные.Константы.ИспользоватьСерииНоменклатуры.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьПечатьЭтикетокИЦенников",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьПечатьЭтикетокИЦенников.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьПланПродаж",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьПланПродаж.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьПодарочныеСертификаты",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьПодарочныеСертификаты.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьПодсистемуЗарплата",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьПодсистемуЗарплата.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьПодсистемуПроизводство",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьПодсистемуПроизводство.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьПодсистемуРаботы",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьПодсистемуРаботы.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьПредоплатуВЧекахККМ",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьПредоплатуВЧекахККМ.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьРегламентированныйУчетЗарплатыИКадров",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьРегламентированныйУчетЗарплатыИКадров.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьРезервированиеДенежныхСредств",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьРезервированиеДенежныхСредств.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиЗакупки",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиЗакупки.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьСборкуЗаказов",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьСборкуЗаказов.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьСборкуЗаказовНаПеремещение",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьСборкуЗаказовНаПеремещение.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьСверкиВзаиморасчетов",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьСверкиВзаиморасчетов.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьСервисРасчетПотребностей",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьСервисРасчетПотребностей.Имя);
	КонстантыНаФорме.Вставить("УчетПотребностиПоСкладам",
		Метаданные.Константы.УчетПотребностиПоСкладам.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьСовместительство",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьСовместительство.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьТехоперации",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьТехоперации.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьХарактеристики",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьХарактеристики.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьЧастичноеПогашениеСертификатов",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьЧастичноеПогашениеСертификатов.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьЭтапыПроизводства",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьЭтапыПроизводства.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияКассовыйМетодУчетаДоходовИРасходов",
		Метаданные.Константы.ФункциональнаяОпцияКассовыйМетодУчетаДоходовИРасходов.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияКонтрольДоговоров",
		Метаданные.Константы.ФункциональнаяОпцияКонтрольДоговоров.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияКредитыИЗаймы",
		Метаданные.Константы.ФункциональнаяОпцияКредитыИЗаймы.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияПередачаЗапасовНаОтветХранение",
		Метаданные.Константы.ФункциональнаяОпцияПередачаЗапасовНаОтветХранение.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияПередачаСырьяВПереработку",
		Метаданные.Константы.ФункциональнаяОпцияПередачаСырьяВПереработку.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияПередачаТоваровНаКомиссию",
		Метаданные.Константы.ФункциональнаяОпцияПередачаТоваровНаКомиссию.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияПереработкаДавальческогоСырья",
		Метаданные.Константы.ФункциональнаяОпцияПереработкаДавальческогоСырья.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияПланироватьЗагрузкуРесурсовПредприятия",
		Метаданные.Константы.ФункциональнаяОпцияПланироватьЗагрузкуРесурсовПредприятия.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи",
		Метаданные.Константы.ФункциональнаяОпцияПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияПланироватьЗагрузкуРесурсовПредприятияРаботы",
		Метаданные.Константы.ФункциональнаяОпцияПланироватьЗагрузкуРесурсовПредприятияРаботы.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияПлатежныйКалендарь",
		Метаданные.Константы.ФункциональнаяОпцияПлатежныйКалендарь.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияПриемЗапасовНаОтветХранение",
		Метаданные.Константы.ФункциональнаяОпцияПриемЗапасовНаОтветХранение.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияПриемТоваровНаКомиссию",
		Метаданные.Константы.ФункциональнаяОпцияПриемТоваровНаКомиссию.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияРазрешитьСкладыВТабличныхЧастях",
		Метаданные.Константы.ФункциональнаяОпцияРазрешитьСкладыВТабличныхЧастях.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияРезервированиеЗапасов",
		Метаданные.Константы.ФункциональнаяОпцияРезервированиеЗапасов.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияСуммовойУчетВРознице",
		Метаданные.Константы.ФункциональнаяОпцияСуммовойУчетВРознице.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияУчетВнеоборотныхАктивов",
		Метаданные.Константы.ФункциональнаяОпцияУчетВнеоборотныхАктивов.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияУчетВРазличныхЕдиницахИзмерения",
		Метаданные.Константы.ФункциональнаяОпцияУчетВРазличныхЕдиницахИзмерения.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияУчетГТД",
		Метаданные.Константы.ФункциональнаяОпцияУчетГТД.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияУчетНоменклатурыПоставщиков",
		Метаданные.Константы.ФункциональнаяОпцияУчетНоменклатурыПоставщиков.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности",
		Метаданные.Константы.ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияУчетПоНесколькимПодразделениям",
		Метаданные.Константы.ФункциональнаяОпцияУчетПоНесколькимПодразделениям.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияУчетПоНесколькимСкладам",
		Метаданные.Константы.ФункциональнаяОпцияУчетПоНесколькимСкладам.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияУчетПоПроектам",
		Метаданные.Константы.ФункциональнаяОпцияУчетПоПроектам.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияУчетПоЯчейкам",
		Метаданные.Константы.ФункциональнаяОпцияУчетПоЯчейкам.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияУчетРозничныхПродаж",
		Метаданные.Константы.ФункциональнаяОпцияУчетРозничныхПродаж.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияУчетЦенКонтрагентов",
		Метаданные.Константы.ФункциональнаяОпцияУчетЦенКонтрагентов.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияУчетЦенПродажи",
		Метаданные.Константы.ФункциональнаяОпцияУчетЦенПродажи.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияРегистрироватьЦеныКонтрагентов",
		Метаданные.Константы.ФункциональнаяОпцияРегистрироватьЦеныКонтрагентов.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяУчетВалютныхОпераций",
		Метаданные.Константы.ФункциональнаяУчетВалютныхОпераций.Имя);
	КонстантыНаФорме.Вставить("ЧастотаРасчетаКурсовыхРазниц",
		Метаданные.Константы.ЧастотаРасчетаКурсовыхРазниц.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьАгентскиеПлатежиИРазделениеВыручки",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьАгентскиеПлатежиИРазделениеВыручки.Имя);
	КонстантыНаФорме.Вставить("ВестиУчетПрослеживаемыхТоваров",
		Метаданные.Константы.ВестиУчетПрослеживаемыхТоваров.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьМинимальныеЦены",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьМинимальныеЦены.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьОписьСдаваемыхДенег",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьОписьСдаваемыхДенег.Имя);
	КонстантыНаФорме.Вставить("ПрефиксВнутреннегоШтрихкодаШтучногоТовара",
		Метаданные.Константы.ПрефиксВнутреннегоШтрихкодаШтучногоТовара.Имя);
	КонстантыНаФорме.Вставить("ИспользоватьСерверЛояльностиПоставщикДанных",
		Метаданные.Константы.ИспользоватьСерверЛояльностиПоставщикДанных.Имя);
	КонстантыНаФорме.Вставить("ВидКартыСерверЛояльности",
		Метаданные.Константы.ВидКартыСерверЛояльности.Имя);
	КонстантыНаФорме.Вставить("ИспользоватьРассрочкуПлатежаВЧекахККМ",
		Метаданные.Константы.ИспользоватьРассрочкуПлатежаВЧекахККМ.Имя);
	КонстантыНаФорме.Вставить("ИспользоватьМаршрутныеЛисты",
		Метаданные.Константы.ИспользоватьМаршрутныеЛисты.Имя);
	КонстантыНаФорме.Вставить("ИспользоватьСтаруюОбработкуПечатиЦенников",
		Метаданные.Константы.ИспользоватьСтаруюОбработкуПечатиЦенников.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияСебестоимостьБезНДС",
		Метаданные.Константы.ФункциональнаяОпцияСебестоимостьБезНДС.Имя);
	КонстантыНаФорме.Вставить("ВидЦеныОтходов",
		Метаданные.Константы.ВидЦеныОтходов.Имя);
	КонстантыНаФорме.Вставить("ЗапретКомиссионныхПартийБезВладельца",
		Метаданные.Константы.ЗапретКомиссионныхПартийБезВладельца.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьПодсчетПосетителей",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьПодсчетПосетителей.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьРегулярныеПлатежи",
		Метаданные.Константы.ФункциональнаяОпцияИспользоватьРегулярныеПлатежи.Имя);
	КонстантыНаФорме.Вставить("ВидНаименованияОрганизацииДляПечатиДокументов",
		Метаданные.Константы.ВидНаименованияОрганизацииДляПечатиДокументов.Имя);
	КонстантыНаФорме.Вставить("ИспользоватьВыплатыСамозанятым",
		Метаданные.Константы.ИспользоватьВыплатыСамозанятым.Имя);
	КонстантыНаФорме.Вставить("ИмпортПодакцизныхТоваров",
		Метаданные.Константы.ИмпортПодакцизныхТоваров.Имя);
	КонстантыНаФорме.Вставить("ПроизводствоПодакцизныхТоваров",
		Метаданные.Константы.ПроизводствоПодакцизныхТоваров.Имя);
	КонстантыНаФорме.Вставить("ИспользоватьДокументРасходыПредпринимателя",
		Метаданные.Константы.ИспользоватьДокументРасходыПредпринимателя.Имя);
	КонстантыНаФорме.Вставить("ФункциональнаяОпцияИспользоватьОплатуСертификатамиНСПК",
		Метаданные.Константы.ИспользоватьОплатуСертификатамиНСПК.Имя);
	#Вставка
	КонстантыНаФорме.Вставить("М3_ФункциональнаяОпцияПлановаяСебестоимость",
		Метаданные.Константы.М3_ФункциональнаяОпцияПлановаяСебестоимость.Имя);
	#КонецВставки	

КонецПроцедуры

#КонецОбласти

#КонецОбласти
